platformio/platform-atmelavr/misc/svd/attiny84.svd
<device>
  <vendor>Atmel</vendor>
  <name>ATtiny84</name>
  <addressUnitBits>8</addressUnitBits>
  <size>8</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0xff</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <description>Analog Comparator</description>
      <baseAddress>0x21</baseAddress>
      <registers>
        <register>
          <name>ACSR</name>
          <description>Analog Comparator Control And Status Register</description>
          <addressOffset>0x7</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACIS</name>
              <description>Analog Comparator Interrupt Mode Select</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ACIS</name><usage>read-write</usage><enumeratedValue><name>ON_TOGGLE</name><description>Interrupt on Toggle</description><value>0</value></enumeratedValue><enumeratedValue><name>ON_FALLING_EDGE</name><description>Interrupt on Falling Edge</description><value>2</value></enumeratedValue><enumeratedValue><name>ON_RISING_EDGE</name><description>Interrupt on Rising Edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ACIC</name>
              <description>Analog Comparator Input Capture Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACIE</name>
              <description>Analog Comparator Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACI</name>
              <description>Analog Comparator Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACO</name>
              <description>Analog Compare Output</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>ACBG</name>
              <description>Analog Comparator Bandgap Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACD</name>
              <description>Analog Comparator Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>ACME</name>
              <description>Analog Comparator Multiplexer Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADC1D</name>
              <description>ADC1 (AIN0) Digital input buffer disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          <field><name>ADC2D</name><description>ADC2 (AIN1) Digital input buffer disable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field>
            </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x21</baseAddress>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register  Bytes</description>
          <addressOffset>0x3</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>ADC Control and Status Register A</description>
          <addressOffset>0x5</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC  Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADPS</name><usage>read-write</usage><enumeratedValue><name>PRESCALER_2</name><description>Prescaler Value 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALER_4</name><description>Prescaler Value 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALER_8</name><description>Prescaler Value 8</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALER_16</name><description>Prescaler Value 16</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALER_32</name><description>Prescaler Value 32</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALER_64</name><description>Prescaler Value 64</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALER_128</name><description>Prescaler Value 128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Source bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADTS</name><usage>read-write</usage><enumeratedValue><name>FREE</name><description>Free Running mode</description><value>0</value></enumeratedValue><enumeratedValue><name>AC</name><description>Analog Comparator</description><value>1</value></enumeratedValue><enumeratedValue><name>INT0</name><description>External Interrupt Request 0</description><value>2</value></enumeratedValue><enumeratedValue><name>TC0_CMA</name><description>Timer/Counter0 Compare Match A</description><value>3</value></enumeratedValue><enumeratedValue><name>TC0_OVF</name><description>Timer/Counter0 Overflow</description><value>4</value></enumeratedValue><enumeratedValue><name>TC0_CMB</name><description>Timer/Counter0 Compare Match B</description><value>5</value></enumeratedValue><enumeratedValue><name>PCIR</name><description>Pin Change Interrupt Request</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>ADC Left Adjust Result</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BIN</name>
              <description>Bipolar Input Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUX</name>
          <description>ADC Multiplexer Selection Register</description>
          <addressOffset>0x6</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        <fields><field><name>MUX</name><description>Analog Channel and Gain Selection Bits</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth><access>read-write</access><enumeratedValues><name>MUX</name><usage>read-write</usage><enumeratedValue><name>ADC0</name><description>Single-ended Input ADC0</description><value>0</value></enumeratedValue><enumeratedValue><name>ADC1</name><description>Single-ended Input ADC1</description><value>1</value></enumeratedValue><enumeratedValue><name>ADC2</name><description>Single-ended Input ADC2</description><value>2</value></enumeratedValue><enumeratedValue><name>ADC3</name><description>Single-ended Input ADC3</description><value>3</value></enumeratedValue><enumeratedValue><name>ADC4</name><description>Single-ended Input ADC4</description><value>4</value></enumeratedValue><enumeratedValue><name>ADC5</name><description>Single-ended Input ADC5</description><value>5</value></enumeratedValue><enumeratedValue><name>ADC6</name><description>Single-ended Input ADC6</description><value>6</value></enumeratedValue><enumeratedValue><name>ADC7</name><description>Single-ended Input ADC7</description><value>7</value></enumeratedValue><enumeratedValue><name>ADC_GND</name><description>0V (GND)</description><value>32</value></enumeratedValue><enumeratedValue><name>ADC_VBG</name><description>Internal Reference (VBG)</description><value>33</value></enumeratedValue><enumeratedValue><name>TEMPSENS</name><description>Temperature sensor</description><value>34</value></enumeratedValue><enumeratedValue><name>ADC0_ADC0_20X</name><description>Differential Inputs Positive ADC0 Negative ADC0 20x Gain</description><value>35</value></enumeratedValue><enumeratedValue><name>ADC0_ADC1_1X</name><description>Differential Inputs Positive ADC0 Negative ADC1 1x Gain</description><value>8</value></enumeratedValue><enumeratedValue><name>ADC0_ADC1_20X</name><description>Differential Inputs Postive ADC0 Negative ADC1 20x Gain</description><value>9</value></enumeratedValue><enumeratedValue><name>ADC0_ADC3_1X</name><description>Differential Inputs Positive ADC0 Negative ADC3 1x Gain</description><value>10</value></enumeratedValue><enumeratedValue><name>ADC0_ADC3_20X</name><description>Differential Inputs Positive ADC0 Negative ADC3 20x Gain</description><value>11</value></enumeratedValue><enumeratedValue><name>ADC1_ADC0_1X</name><description>Differential Inputs Positive ADC1 Negative ADC0 1x Gain</description><value>40</value></enumeratedValue><enumeratedValue><name>ADC1_ADC0_20X</name><description>Differential Inputs Positive ADC1 Negative ADC0 20x Gain</description><value>41</value></enumeratedValue><enumeratedValue><name>ADC1_ADC2_1X</name><description>Differential Inputs Positive ADC1 Negative ADC2 1x Gain</description><value>12</value></enumeratedValue><enumeratedValue><name>ADC1_ADC2_20X</name><description>Differential Inputs Positive ADC1 Negative ADC2 20x Gain</description><value>13</value></enumeratedValue><enumeratedValue><name>ADC1_ADC3_1X</name><description>Differential Inputs Positive ADC1 Negative ADC3 1x Gain</description><value>14</value></enumeratedValue><enumeratedValue><name>ADC1_ADC3_20X</name><description>Differential Inputs Positive ADC1 Negative ADC3 20x Gain</description><value>15</value></enumeratedValue><enumeratedValue><name>ADC2_ADC1_1X</name><description>Differential Inputs Positive ADC2 Negative ADC2 1x Gain</description><value>44</value></enumeratedValue><enumeratedValue><name>ADC2_ADC1_20X</name><description>Differential Inputs Positive ADC2 Negative ADC2 20x Gain</description><value>45</value></enumeratedValue><enumeratedValue><name>ADC2_ADC3_1X</name><description>Differential Inputs Positive ADC2 Negative ADC3 1x Gain</description><value>16</value></enumeratedValue><enumeratedValue><name>ADC2_ADC3_20X</name><description>Differential Inputs Positive ADC2 Negative ADC3 20x Gain</description><value>17</value></enumeratedValue><enumeratedValue><name>ADC3_ADC0_1X</name><description>Differential Inputs Positive ADC3 Negative ADC0 1x Gain</description><value>42</value></enumeratedValue><enumeratedValue><name>ADC3_ADC0_20X</name><description>Differential Inputs Positive ADC3 Negative ADC0 20x Gain</description><value>43</value></enumeratedValue><enumeratedValue><name>ADC3_ADC1_1X</name><description>Differential Inputs Positive ADC3 Negative ADC1 1x Gain</description><value>46</value></enumeratedValue><enumeratedValue><name>ADC3_ADC1_20X</name><description>Differential Inputs Positive ADC3 Negative ADC1 20x Gain</description><value>47</value></enumeratedValue><enumeratedValue><name>ADC3_ADC2_1X</name><description>Differential Inputs Positive ADC3 Negative ADC2 1x Gain</description><value>48</value></enumeratedValue><enumeratedValue><name>ADC3_ADC2_20X</name><description>Differential Inputs Positive ADC3 Negative ADC2 20x Gain</description><value>49</value></enumeratedValue><enumeratedValue><name>ADC3_ADC3_1X</name><description>Differential Inputs Positive ADC3 Negative ADC3 1x Gain</description><value>36</value></enumeratedValue><enumeratedValue><name>ADC3_ADC3_20X</name><description>Differential Inputs Positive ADC3 Negative ADC3 20x Gain</description><value>37</value></enumeratedValue><enumeratedValue><name>ADC3_ADC4_1X</name><description>Differential Inputs Positive ADC4 Negative ADC0 1x Gain</description><value>18</value></enumeratedValue><enumeratedValue><name>ADC3_ADC4_20X</name><description>Differential Inputs Positive ADC4 Negative ADC0 20x Gain</description><value>19</value></enumeratedValue><enumeratedValue><name>ADC3_ADC5_1X</name><description>Differential Inputs Positive ADC5 Negative ADC1 1x Gain</description><value>20</value></enumeratedValue><enumeratedValue><name>ADC3_ADC5_20X</name><description>Differential Inputs Positive ADC5 Negative ADC1 20x Gain</description><value>21</value></enumeratedValue><enumeratedValue><name>ADC3_ADC6_1X</name><description>Differential Inputs Positive ADC6 Negative ADC2 1x Gain</description><value>22</value></enumeratedValue><enumeratedValue><name>ADC3_ADC6_20X</name><description>Differential Inputs Positive ADC6 Negative ADC2 20x Gain</description><value>23</value></enumeratedValue><enumeratedValue><name>ADC3_ADC7_1X</name><description>Differential Inputs Positive ADC7 Negative ADC3 1x Gain</description><value>24</value></enumeratedValue><enumeratedValue><name>ADC3_ADC7_20X</name><description>Differential Inputs Positive ADC7 Negative ADC3 20x Gain</description><value>25</value></enumeratedValue><enumeratedValue><name>ADC4_ADC3_1X</name><description>Differential Inputs Positive ADC4 Negative ADC3 1x Gain</description><value>50</value></enumeratedValue><enumeratedValue><name>ADC4_ADC3_20X</name><description>Differential Inputs Positive ADC4 Negative ADC3 20x Gain</description><value>51</value></enumeratedValue><enumeratedValue><name>ADC4_ADC5_1X</name><description>Differential Inputs Positive ADC4 Negative ADC5 1x Gain</description><value>26</value></enumeratedValue><enumeratedValue><name>ADC4_ADC5_20X</name><description>Differential Inputs Positive ADC4 Negative ADC5 20x Gain</description><value>27</value></enumeratedValue><enumeratedValue><name>ADC5_ADC3_1X</name><description>Differential Inputs Positive ADC5 Negative ADC3 1x Gain</description><value>52</value></enumeratedValue><enumeratedValue><name>ADC5_ADC3_20X</name><description>Differential Inputs Positive ADC5 Negative ADC3 20x Gain</description><value>53</value></enumeratedValue><enumeratedValue><name>ADC5_ADC4_1X</name><description>Differential Inputs Positive ADC5 Negative ADC4 1x Gain</description><value>58</value></enumeratedValue><enumeratedValue><name>ADC5_ADC4_20X</name><description>Differential Inputs Positive ADC5 Negative ADC4 20x Gain</description><value>59</value></enumeratedValue><enumeratedValue><name>ADC5_ADC6_1X</name><description>Differential Inputs Positive ADC5 Negative ADC6 1x Gain</description><value>28</value></enumeratedValue><enumeratedValue><name>ADC5_ADC6_20X</name><description>Differential Inputs Positive ADC5 Negative ADC6 20x Gain</description><value>29</value></enumeratedValue><enumeratedValue><name>ADC6_ADC3_1X</name><description>Differential Inputs Positive ADC6 Negative ADC3 1x Gain</description><value>54</value></enumeratedValue><enumeratedValue><name>ADC6_ADC3_20X</name><description>Differential Inputs Positive ADC6 Negative ADC3 20x Gain</description><value>55</value></enumeratedValue><enumeratedValue><name>ADC6_ADC5_1X</name><description>Differential Inputs Positive ADC6 Negative ADC5 1x Gain</description><value>60</value></enumeratedValue><enumeratedValue><name>ADC6_ADC5_20X</name><description>Differential Inputs Positive ADC6 Negative ADC5 20x Gain</description><value>61</value></enumeratedValue><enumeratedValue><name>ADC6_ADC7_1X</name><description>Differential Inputs Positive ADC6 Negative ADC7 1x Gain</description><value>30</value></enumeratedValue><enumeratedValue><name>ADC6_ADC7_20X</name><description>Differential Inputs Positive ADC6 Negative ADC7 20x Gain</description><value>31</value></enumeratedValue><enumeratedValue><name>ADC7_ADC3_1X</name><description>Differential Inputs Positive ADC7 Negative ADC3 1x Gain</description><value>56</value></enumeratedValue><enumeratedValue><name>ADC7_ADC3_20X</name><description>Differential Inputs Positive ADC7 Negative ADC3 20x Gain</description><value>57</value></enumeratedValue><enumeratedValue><name>ADC7_ADC6_1X</name><description>Differential Inputs Positive ADC7 Negative ADC6 1x Gain</description><value>62</value></enumeratedValue><enumeratedValue><name>ADC7_ADC6_20X</name><description>Differential Inputs Positive ADC7 Negative ADC6 20x Gain</description><value>63</value></enumeratedValue><enumeratedValue><name>ADC7_ADC7_1X</name><description>Differential Inputs Positive ADC7 Negative ADC7 1x Gain</description><value>38</value></enumeratedValue><enumeratedValue><name>ADC7_ADC7_20X</name><description>Differential Inputs Positive ADC7 Negative ADC7 20x Gain</description><value>39</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>REFS</name><description>Reference Selection Bits</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><name>REFS</name><usage>read-write</usage><enumeratedValue><name>VCC</name><description>Vcc used as Voltage Reference, disconnected from Aref</description><value>0</value></enumeratedValue><enumeratedValue><name>AREF</name><description>External Voltage Reference at AREF pin, Internal Voltage Reference turned off</description><value>1</value></enumeratedValue><enumeratedValue><name>INTERNAL</name><description>Internal 1.1V Voltage Reference</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            </fields></register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register 0</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
