platformio/platform-atmelavr/misc/svd/attiny84.svd
      </registers>
      </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x3C</baseAddress>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>EEPM</name><usage>read-write</usage><enumeratedValue><name>ATOMIC</name><description>Atomic (erase and write in one operation)</description><value>0</value></enumeratedValue><enumeratedValue><name>ERASE</name><description>Erase only</description><value>1</value></enumeratedValue><enumeratedValue><name>WRITE</name><description>Write only</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x32</baseAddress>
      <registers>
        <register>
          <name>GIFR</name>
          <description>General Interrupt Flag register</description>
          <addressOffset>0x28</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTF0</name>
              <description>External Interrupt Flag 0</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GIMSK</name>
          <description>General Interrupt Mask Register</description>
          <addressOffset>0x29</addressOffset>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT0</name>
              <description>External Interrupt Request 0 Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x23</addressOffset>
          <fields>
            <field><name>ISC0</name><description>Interrupt Sense Control 0 bits</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access><enumeratedValues><name>ISC0</name><usage>read-write</usage><enumeratedValue><name>LOW</name><description>The low level of INTx generates an interrupt request</description><value>0</value></enumeratedValue><enumeratedValue><name>TOGGLE</name><description>Any logical change on INTx generates an interrupt request</description><value>1</value></enumeratedValue><enumeratedValue><name>FALLING</name><description>The falling edge of INTx generates an interrupt request</description><value>2</value></enumeratedValue><enumeratedValue><name>RISING</name><description>The rising edge of INTx generates an interrupt request</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Enable Mask 0</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Enable Mask 1</description>
          <addressOffset>0xE</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
