platformio/platform-atmelavr/misc/svd/attiny84.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x0</baseAddress>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>SELFPRGEN</name>
              <description>Self Programming enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RSTDISBL</name>
              <description>Reset Disabled (Enable PB3 as i/o pin)</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock source</description>
              <bitRange>[5:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_0MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_0MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_0MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_14CK_0MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/14 CK + 0 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 4.1 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 65 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_4MS1</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4.1 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_4MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_4MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 4 ms</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_14CK_4MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 1K CK/14 CK + 4 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_258CK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_65MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_64MS_DEFAULT</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; default value</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOSC_128KHZ_6CK_14CK_64MS</name>
                  <description>WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_14CK_64MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time PWRDWN/RESET: 32K CK/14 CK + 64 ms</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_0MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 4.1 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ4_0MHZ9_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.4-0.9 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_0MHZ9_3MHZ_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 0.9-3.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_3MHZ_8MHZ_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 3.0-8.0 MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_1KCK_14CK_4MS1</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 1K CK /14 CK + 4.1 ms</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTXOSC_8MHZ_XX_16KCK_14CK_65MS</name>
                  <description>Ext. Crystal Osc. 8.0-    MHz; Start-up time PWRDWN/RESET: 16K CK/14 CK + 65 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTB2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
